'''
문제 11: 파이썬에서 리스트에 다른 리스트를 추가하는 메서드는?  1
1. append()
2. extend()
3. insert()
4. add()

>> a1 = [1,2,3,4,5]
>> a2 = [6,7,8,9,10]
>> a1.append(a2)
>> print(a1)
[1, 2, 3, 4, 5, [6, 7, 8, 9, 10]]


문제 12: 파이썬 함수 정의
파이썬에서 함수를 정의할 때 사용하는 키워드는? 3
1. func
2. method
3. def
4. function

>> def func_name():
>> ...
>> ...

문제 13: 파이썬에서 'elif'는 무엇을 위해 사용됩니까?  2
1. if문의 조건이 거짓일 때 실행
2. 여러 조건을 체크하기 위해
3. 예외 처리
4. 루프 제어

>>a= 3
>>if a > 4 :
>>    print('1')
>>elif a >= 3:
>>    print('2')
>>else:
>>    print('3')

>> 2

문제 14: 파이썬 상속
다음 중 파이썬에서 자식 클래스에서 부모 클래스의 메서드를 호출할 때 사용하는 키워드는? 1
1. super
2. extend
3. inherit
4. parent

>> class BB(AA):
>>    def __init__(self,a,b):
>>        super().__init__(a,b)

문제 15: 다음 중 파이썬의 기본 데이터 타입이 아닌 것은? 4
1. 문자열 (str)
2. 정수 (int)
3. 실수 (float)
4. 객체 (object)

파이썬 기본 데이터 타입(자료형) : bool , str , int , float , double , list , bytes
1. (3)
2. (4)
3. (1)
4. (4)
5. (4)
---
6.(2)
7.(1)
8.(3)(4)
9.(1)
10.(4)
---
11.(1)
12.(3)
13.(2)
14.(1)
15.(4)
---
16. (1)
17. (1)
18. (3)
19. (2)
20. (1)
'''

